API_FICPlus/app/Models/Usuarios.php

SELECT *
FROM `usuario`
WHERE `Correo` IS NULL
---
    public function getDatos($correo)
    {
        var_dump($correo); // Agrega esta línea para depurar
        return $this->getWhere(['Correo' => $correo])->getRow();