API_FICPlus/app/Controllers/PeliculasController.php

SELECT *
FROM `peliculas`
WHERE `ID_Peliculas` = 'index'
---
    public function show($id = null)
    {
        $ModeloPeliculas = new Peliculas();
        $pelicula = $ModeloPeliculas->getWhere(['ID_Peliculas' => $id])->getResult();