API_FICPlus/app/Controllers/PeliculasController.php

    public function showall()
    {
        $ModeloPeliculas = new Peliculas();
        $ModeloCategorias = new Categorias();
        //Busca las categorias
        $Categorias = $ModeloCategorias->findAll();
        //Crea el archivo de los datos dividiendo las peliculas por  categorias
        for($i = 0;$i<count($Categorias);$i++){

        $categoria = $Categorias[$i]['Categoria'];
        $peliculas = $ModeloPeliculas->getWhere(['ID_Categoria' => $Categorias[$i]['ID_Categorias']])->getResult();
---
SELECT *
FROM `categorias`
SELECT *
FROM `peliculas`
WHERE `ID_Categoria` = '1'