API_FICPlus/app/Controllers/UsuariosController.php

    public function login()
    {
        $Datos = [
            'Correo' => $this->request->getVar('email'),
            'Contra' => $this->request->getVar('password')
        ];
        $modelo = new Usuarios();

        $solicitud = $modelo->getWhere(['Correo' => $Datos['Correo']])->getRow();
---
SELECT *
FROM `usuario`
WHERE `Correo` = 'Alfredo@gmail.com'