API_FICPlus/app/Controllers/UsuariosController.php

    public function create()
    {
        //METODO POST
        $Modelo = new Usuarios();
        $datos = [
            'Nombre_Usuario' => $this->request->getVar('Nombre_Usuario'),
            'Apellido_Usuario' => $this->request->getVar('Apellido_Usuario'),
            'Correo' => $this->request->getVar('Correo'),
            'Contrasenia' => $this->request->getVar('Contrasenia')
        ];
        $datos['Contrasenia'] = md5($datos['Contrasenia']);


        $Modelo->insert($datos); //Se insertan los Datos en la BD
---
INSERT INTO `usuario` (`Nombre_Usuario`, `Apellido_Usuario`, `Correo`, `Contrasenia`) VALUES ('joel', 'andres', 'cacapopo@gmail.com', '572f9ae44ee3eefd4596212d97c90d88')